package addSql;

import java.util.Date;
import java.util.Random;

import com.zhiyou.util.DatabaseUtil;

public class AddLessee {
	public static void main(String[] args) {
		DatabaseUtil dbUtil = new DatabaseUtil();
		Random ran = new Random();
		String sql = "update lessee set l_flag=0 where l_id=?";
		for(int i=0;i<102;i++){
			Object[] objs = {ran.nextInt(2002)};
			int j = dbUtil.update(sql, objs);
			System.out.println("成功修改"+j+"条记录");
		}
		/*String[] name = {"张吉惟","林国瑞","林玟书","林雅南","江奕云","刘柏宏","阮建安","林子帆","夏志豪","吉茹定",
						 "黄文隆","谢彦文","傅智翔","洪振霞","刘姿婷","荣姿康","吕致盈","方一强","黎芸贵","郑伊文",
						 "陈枝盈","高成彦","徐采伶","杨大雪","林彦韦","李升毓","邱宜瑶","陈政文","李宜豪","陈宜",
						 "陈伯薇","陈昭祥","陈伟伦","黄雅慧","郭子豪","黄彦霖","宋合","许雅婷","理如","何伶元"
						};
		String[] tel = {"13007501722","13007502577","13007503733","13007501822","13007503677","13007503922","13007505377","13007505633","13007505933","13007600009",
						"13071058181","13071058383","13071055012","13071051012","13071035511","13071050012","13071032121","13071027711","13071023131","13027738888",
						"13027799299","13027703838","13027702525","13027700303","13027627171","13027626789","13027625757","13027622525","13027523566","13027522223",
						"13073762577","13103710009","13083666666","13073792577","13073792077","13073785377","13073783977","13073782877","13073761277","13073760611"};
		String[] sex = {"男","女"};
		String[] jg = {"河南省邓州市","河南省洛阳市","河南省开封市","湖北省襄阳市","湖北省武汉市","湖南省长沙市","安徽省合肥市","广东省东莞市","广东省深圳市","广西省云南市",
						"广东省广东市","福建省福州市","福建省厦门市","江西省南昌市","山东省济南市","山东省青岛市","山东省廊坊市","辽宁省大连市","海南省三亚市","四川省成都市",
						"湖南省岳阳市","广东省佛山市","云南省西双版纳","贵州省遵义市","西藏省拉萨市","浙江省杭州市","浙江省苏州市","江苏省南京市","浙江省温州市","江西省九江市"};
		String[] card = {"513436200008286216","513436200008288975","513436200008287091","513436200008289310","511823198401103218","511823198401103939","450311197509084165","450311197509083568","450311197509081482","511823198401107518",
						 "511823198401103218","450311197509086902","511823198401103891","51182319840110689X","210203197503102721","130102196303250459","511502199103223189","431202198811101720","130821199103278829","520323197806058856",
						 "350105199506138487","610729197408202551","820000195008115837","450101197405207446","411626198204167401","654022197901228286","152224198908049211","230822197201256034","","",
						 "321084198804146435","110115195708043734","542301195808073257","320903199210101090","320682199112074796","320923199102271688","321202199304125444","500232195510054491","500120199201092758","50011919730523762X"};
		String sql = "insert into lessee(l_name,l_tel,l_sex,l_native_place,l_id_card,l_create_time,l_flag) values(?,?,?,?,?,?,?)";
		for(int i=0;i<1000;i++){
			Object[] objs = {name[ran.nextInt(40)],tel[ran.nextInt(40)],sex[ran.nextInt(2)],jg[ran.nextInt(30)],card[ran.nextInt(40)],new Date(),1};
			int j = dbUtil.update(sql, objs);
			System.out.println("成功添加"+j+"条记录");
		}*/
	}
}
